app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def current_user
        return unless session[:current_user_id]
        @current_user ||= User.find_by(id: session[:current_user_id])